app/controllers/equipment_controller.rb

SELECT "equipment".* FROM "equipment"
---
  def index
    @equipment = Equipment.all

INSERT INTO "equipment" ("title", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test 1"], ["img", "https://tinyurl.com/y23nu3bh"], ["created_at", "2019-08-12 01:21:13.759836"], ["updated_at", "2019-08-12 01:21:13.759836"]]
---
  def create
    @equipment = Equipment.new(equipment_params)

    if @equipment.save

UPDATE "equipment" SET "title" = $1, "img" = $2, "make" = $3, "model" = $4, "year" = $5, "rate" = $6, "location" = $7, "updated_at" = $8 WHERE "equipment"."id" = $9
---
  def update
    if @equipment.update(equipment_params)

DELETE FROM "equipment" WHERE "equipment"."id" = $1  [["id", 2]]
---
  def destroy
    @equipment.destroy

SELECT "equipment".* FROM "equipment" WHERE "equipment"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_equipment
      @equipment = Equipment.find(params[:id])